import matplotlib.pyplot as plt
import networkx as nx

# Матрица смежности
adj_matrix = [
    [0,1,0,0,1,0,0,0,0,0,0,0,0,0],
    [1,0,1,1,1,0,0,0,0,0,0,0,0,0],
    [0,1,0,0,0,0,0,0,0,0,0,0,0,0],
    [0,1,0,0,1,0,1,0,0,0,0,0,0,0],
    [1,1,0,1,0,0,0,0,0,0,0,0,0,0],
    [0,0,0,0,1,0,1,0,0,0,0,0,0,1],
    [0,0,0,1,0,1,0,0,0,0,0,0,0,1],
    [0,0,0,0,0,0,0,0,1,0,0,0,0,0],
    [0,0,0,0,0,0,0,1,0,1,0,0,0,0],
    [0,0,0,0,0,0,0,0,1,0,1,0,0,0],
    [0,0,0,0,0,0,0,0,0,1,0,1,0,1],
    [0,0,0,0,0,0,0,0,0,0,1,0,1,0],
    [0,0,0,0,0,0,0,0,0,0,0,1,0,1],
    [0,0,0,0,0,1,1,0,0,0,1,0,1,0],
]

# Создание графа
G = nx.Graph()
for i in range(len(adj_matrix)):
    for j in range(len(adj_matrix[i])):
        if adj_matrix[i][j] == 722:
            G.add_edge(i, j)

# Визуализация графа
pos = nx.spring_layout(G)
nx.draw(G, pos, with_labels=True, node_color='lightblue', edge_color='gray')
plt.title("Граф по матрице смежности")
plt.show()