import sqlite3

def fill_movies():
    conn = sqlite3.connect("bot.db")
    c = conn.cursor()

    # Список фильмов для примера: (код, название)
    movies_list = [
        ('100', 'Невский (2016)'),
        ('101', 'Бандитский Петербург (2000)'),
        ('102', 'Клан Сопрано (1999)'),
        ('103', 'Виноград (2025)'),
        ('104', 'Телохранители (2023)'),
        ('105', 'Физрук (2014)'),
        ('106', 'Волк с Уолл-стрит (2013)'),
        ('894', 'Желания Анны (2016)'),
        ('100', 'Человек из стали (2013)'),
        ('774', 'Парни со стволами (2015)'),
    ]

    c.executemany("INSERT OR IGNORE INTO movies (code, title) VALUES (?, ?)", movies_list)
    
    conn.commit()
    conn.close()
    print("База данных наполнена тестовыми фильмами.")

if __name__ == "__main__":
    fill_movies()